app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index
      @sort = params[:sort]
      @movies = Movie.all.order(@sort)