app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.ratings
      @sort = params[:sort] || session[:sort]
      session[:ratings] = session[:ratings] || {'G'=>'', 'PG'=>'', 'PG-13'=>'', 'R'=>''}
      @t_param = params[:ratings] || session[:ratings]
      session[:sort] = @sort
      session[:ratings] =@t_param
      @movies = Movie.where(rating: session[:ratings].keys).order(session[:sort])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date